#ifndef DOCSRUCTS_H_
#define DOCSRUCTS_H_

#include <time.h>
#include <stdint.h>

//#include "filter.h"

#define byte unsigned char
#define bool  char
#define word unsigned short


typedef struct{
	unsigned char nType;    // FORMULAR_TRASSA ( 15 )
	unsigned int ShP 	: 1;// ШП - признак помехлпостановщикаchar0; (пассивная, активная)
	unsigned int PA 	: 1;// ПА - признак сопровождения в полуавтоматическом режимепомехлпостановщикаchar0;
	unsigned int PNS 	: 1;// ПНС - признак неустойстового сопровождения
	unsigned int SBR 	: 1;// СБР - признак сброса
	unsigned int MPO 	: 1;// МПО - признак малоподвижного объекта
/*f*/	unsigned int SV 	: 2;// СВ  - 0 -неопозна 1-чужая, 2-своя
	unsigned int PZ     : 1;// ПЗ  - признак захвата
/*f*/	unsigned int TC     : 4;// ТЦ - тип цели 0-неопр, 1-надв, 8-возд неопр, 9-ловушка, 10-самолет,
        						// 11-ПКР, 12-ПРР, 13-ВЕРТ, 15-ВПЦ;
	unsigned int bVz    : 1;// Пн - признак наличия скорости по высоте
	unsigned int NEW   : 1; //Признак новой трассы
	unsigned int bKT   : 1; //Признак привязки КТ
	unsigned int PRC   : 1; //Признак приоритетной цели
/*f*/	unsigned int nSource: 8;// НТномер трассы
	
	unsigned long t;		// ТЭ - время измерения или эквтраполяции
	
	unsigned int X 		: 16;// X или пеленг;
	unsigned int TNO 	: 16;// ТНО - текущий номер обзора
	
	unsigned int H 		: 16;// H  - высота или УМ
	unsigned int Y 		: 16;// Y
	
	unsigned int skoY 	: 16;// СКОУ
	unsigned int skoX 	: 16;// СКОХ
	
	unsigned int Vx 	: 10;// Vx или Vпеленг
	unsigned int skoVx 	: 6;// СКО Vx
	unsigned int skoH 	: 16;// СКО Н
	
	unsigned int Vh 	: 10;// Vh или Vум
	unsigned int skoVh 	: 6;// СКО Vh
	unsigned int Vy 	: 10;// Vy
	unsigned int skoVy 	: 6;// СКО Vy
}DocFormularTrassa; // Формуляр трасса 2

typedef struct{ // тип для  ИП3 из Пумы
	int indPuma; // 0-3 индекс канала ПУМЫ
/*f*/	byte nPuma; // НЦ в нумерации ПУМЫ (1-63) или 0
/*f*/	word nRls; // НЦ в нумерации РЛС (1-999) или 0
/*f*/	byte prn; // 1-чужая, 2-своя
		byte typeSource; // 0-неопр, 16-МТК(ПБ), 17-МТК(ЛБ),  19-Монумент, 21-РЛК, >29-Пума
		bool imc; // признак имитированной цели
/*f*/	byte objType; //0-неопр, 1-ВЦ, 3,4-МЦ(НЦ),11-вертолет, 12-самолет(СМЛ), 13-ПРР, 14-ПКР, 15-ВПЦ
	byte nau[3]; //назначение в РЭСУ цели:  0-не назначена, 1-цель основная, 2-цель резервная, 3-цель основная и резервная
	byte rrc; //0-нет работы,2-обнаружение, 3-захват, 4-АС,5-ИС, 6-ПА, 7-срыв сопровождения
	byte rsd;//разрешение на снятие данных ЦУ 1-да
	byte dcu;//доклад о работе по внешнему ЦУ 1-ЦУ принимается, 2-ЦУ принято, 3-срыв сопровождения цели
           // 4-отказ от приема ЦУ, 5-отмена ЦУ ринята
	byte ppc;// признак действия по цели 2-цель поражена
	byte fire[3];//1-веду огонь - на время замыкания педали
	byte sks; 	// 0-скорости в прямоугольная СК
	byte skk; 	// 0-прямоугольная СК, 1-полярная (П,УМ)
	bool bVx; 	// наличие Vx
	bool bVy; 	// наличие Vy
	bool bVh; 	// наличие Vh
	bool bx;  	// наличие x(П)
	bool by;  	// наличие y(УМ)
	bool bh;  	// наличие h
	byte sourceCu; // источник данных ЦУ 0-неопр, 1-данные источника, иначе-Пума
	float x;	// в м, или П (рад) - координаты биссектрисы заданного сектора
	float y;    // в м, или УМ (рад) - координаты биссектрисы заданного сектора
	float h;    // в м
	float vx;	// в м/с
	float vy;   // в м/с
	float vh; 	// в м/с
}DocIP3_Puma;

typedef struct 
{
	float course;//курс-радианы
	double fi;//широта-градусы
	double lambda;//долгота-градусы
}DocOurShipGeo; 

typedef struct 
{
	double currentTime;// текущее время УС, сек. от включения
	unsigned int timeSigma;//текущее корабельное время
	unsigned int timeBOS;// текущее время БОС, мс
	word time3K96;// текущее время Редута, мс
	word reserve0;
	float reserve1;
	float reserve2;
	float reserve3;
}DocTime;

typedef struct{
	float			pel; // ПЕЛЕНГ ТРЕВОГИ, рад
}DocDev67Alarm;

typedef struct{
	bool B;//,бедствие
	bool PN;//,признак поступления номера цели (только в 4м режиме)
	unsigned short	num;//,номер цели (только в 4м режиме)
	float	pel;// град
	float	dist;// км
	byte line;// 1,2,4
	byte mode;//1-КОРАБЛЬ 2-САМОЛЕТ
	word numberRLK;
}DocDev67Tgt; // цель обнаружена 67 изделием + отожденствлена РЛК

typedef struct 
{
	unsigned short b5P27	: 1;  
	unsigned short b3K96	: 1;
	unsigned short bSigma	: 1;
	unsigned short b5P20	: 1;
	unsigned short bMTK		: 1;
	unsigned short bSfera	: 1;
	unsigned short bX	: 1;
	unsigned short res	: 10;
} SourceGo;

typedef struct 
{
	word numberRlk;//// номер канала РЛС
	word numberX;// номер канала X
	word numberSfera;// номер канала Sfera
	SourceGo sourceGo;// истоник(и) заявки
	word parameter;//причина
}Doc67Zapros; //DI_SwitchOff67 выключение запросчика+сброс цели с опознавания
 // DI_NewZapros67новый запрос по цели
 // DI_DeleteZapros удаление запроса из очереди запросов
//  DI_Zapros67 произвести ГО в ПА режиме

typedef struct 
{// типа DI_ZaprosSkol67  запрос на опознавание по сколу
	  unsigned int lineSkol; // линия скола 1-корабль 2-самолет 
	  unsigned int modeSkol;  // режим скола 1-I, 2-II, 4-IV, 0- текущий  		    
	  float pelengSkol;// пеленг скола, рад
	  float distanceSkol;// дистанция наклонная скола, м	
	  float reserve[4];
}Doc67ZaprosSkol; //

typedef struct 
{
	word numberRlk;// номер канала РЛС
	unsigned int own: 3;// 1-свой 2-чужой 0-неопознанный
	unsigned int  bX: 5;// признак передачи цели в нумерации Х, 2-Сфера
}DocHandGO; // назначение признака ГП

typedef struct 
{
	word numberRlk;// номер канала РЛС
	word numberShootChannel;    // номер стрельбового канала
	word parameter; // причина
}DocTaskTarget;// задание цели

typedef struct 
{
	word numberFurke;// номер канала РЛС
	word numberX;// номер канала РЛС
	word numberEco;// номер канала РЛС
	word numberShootChannel;    // номер стрельбового канала
	word parameter; // причина
}DocTaskTargetAll;// задание цели

typedef struct 
{
	word numberShootChannel;// номер стрельбового канала
	word parameter; // причина
}DocNullShootChannel; // сброс канала
// DI_NullShootChannelOperator; // сброс канала оператором
// DI_NullShootChannel; // сброс канала,расшифровка причины

typedef struct 
{
	word numberShootChannel;// номер стрельбового канала
	word parameter; // причина
}DocResetShootChannel; // сброс канала
// DI_ResetShootChannel; // выставление признака сброс стрельбовому каналу


typedef struct 
{
/*f*/	unsigned int nSource: 8;// НТ номер трассы
	unsigned int reserve: 24;	
}DocSendRli; 
// DI_SendRli // цель выдана в канал РЛИ

typedef struct 
{
	unsigned int reserve: 32;	
}DocSendRedut; 
// DI_SendRedut // выдача пакета в Редут

typedef struct 
{
	word numberRlk;				// номер канала РЛR	
	word numberShootChannel;    // номер стрельбового канала	
	word RVV;	// 1-цель сопровождать с повышенной точность,0-отмена RVV
	word reserve;	
}DocRVVRedut; 
// DI_RVVRedut // запрос о сопровождении с повышенной точностью


typedef struct
{
        unsigned char nType;    // OPERATOR_DIRECTIVE ( 1 )
        unsigned int TC 	: 4;	//!< признак типа цели 0-неопр, 1-надв, 8-возд неопр, 9-ловушка, 10-самолет, 
		// 11-ПКР, 12-ПРР, 13-ВЕРТ, 15-ВПЦ;
        unsigned int NTC 	: 1;	 //!< признак назначения типа цели
        unsigned int PC 	: 1;	//!< признак назначения приоритетной цели
        unsigned int YST 	: 1;	//!< признак назначения юстировочных констант
